#+TITLE: Experiment 100: Emacs + Racket Integration
#+AUTHOR: RacketCon 2025
#+DATE: 2025-10-05
#+STARTUP: overview

*** Example Org Block

#+begin_example
#+begin_src racket :results output
#lang racket

(define (factorial n)
  (if (zero? n)
      1
      (* n (factorial (- n 1)))))

(displayln (factorial 5))
#+end_src

#+RESULTS:
: 120
#+end_example

